/*
Пример, в който се демонстрира обектно ориентираната библиотека на 
C++ за манипулиране на стрингове.
Вградената функция find
*/

#include <iostream>
// Библиотека нужна за манипулация със стрингове 
#include <string>
using namespace std;


// Тук създаваме два обекта от тип стринг s1 и s2
// и ги инициализираме със съответните стойности 
string s1 = ("Enter your name and terminate with $ \n");
string s2 = "========================================="; //възможно е и подобно инициализиране
string prompt;
string Name;

int n; //Променлива необходима за демонстрация на търсене в стрингове  

int main(){
   
  //Подобно манипулиране със стрингове е възможно само в C++
  //Подробно ще разгледаме преконфигурирането на оператори в следващите уроци т.н. operator overloading
  //тук оператора + обединява два или повече стринга

  prompt = s1+s2;

  // Отпечатване на резултантния стринг
  cout<< prompt <<endl;

  getline(cin,Name,'$'); // Още един начин за записване на стринг в променлива Name
  // Тук се използва и терминиращ символ '$', ако не се въведе в края на реда на при 
  //натискане на Enter ще преминем на нов ред, но няма да завършим въвеждането

  cout<<Name<<endl;

  n = s1.find("name");

  cout<<"the word \"name\" is started after charter "<< n <<" in string s1."<<endl;

 // Още интересни функции за търсене като find на странцица 306
  return 0;
}

